first_routes/app/controllers/concerns/artworks_controller.rb

    def index
        @artworks = Artwork.find(params[:user_id])
        @user = User.find(params[:user_id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "www.changedURL.com"], ["updated_at", "2022-01-12 21:27:29.367932"], ["id", 4]]