first_routes/app/controllers/concerns/artwork_shares_controller.rb

    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
        if @artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 2], ["created_at", "2022-01-12 21:45:03.061075"], ["updated_at", "2022-01-12 21:45:03.061075"]]